zephyrproject-rtos/hal_infineon/dts/infineon/tc3x/tc37xEXT-irq.h
/*
* Copyright (c) 2024 Infineon Technologies AG
* SPDX-License-Identifier: Apache-2.0
*/

#ifndef TC37XEXT_IRQ_H
#define TC37XEXT_IRQ_H
#define IRQ_CPU0_SB 0
#define IRQ_CPU1_SB 1
#define IRQ_CPU2_SB 2
#define IRQ_SBCU 8
#define IRQ_EBCU 9
#define IRQ_AGBT0_SR 11
#define IRQ_XBAR0 12
#define IRQ_XBAR2 14
#define IRQ_CERBERUS_SR0 16
#define IRQ_CERBERUS_SR1 17
#define IRQ_ASCLIN0_TX 20
#define IRQ_ASCLIN0_RX 21
#define IRQ_ASCLIN0_ERR 22
#define IRQ_ASCLIN1_TX 23
#define IRQ_ASCLIN1_RX 24
#define IRQ_ASCLIN1_ERR 25
#define IRQ_ASCLIN2_TX 26
#define IRQ_ASCLIN2_RX 27
#define IRQ_ASCLIN2_ERR 28
#define IRQ_ASCLIN3_TX 29
#define IRQ_ASCLIN3_RX 30
#define IRQ_ASCLIN3_ERR 31
#define IRQ_ASCLIN4_TX 32
#define IRQ_ASCLIN4_RX 33
#define IRQ_ASCLIN4_ERR 34
#define IRQ_ASCLIN5_TX 35
#define IRQ_ASCLIN5_RX 36
#define IRQ_ASCLIN5_ERR 37
#define IRQ_ASCLIN6_TX 38
#define IRQ_ASCLIN6_RX 39
#define IRQ_ASCLIN6_ERR 40
#define IRQ_ASCLIN7_TX 41
#define IRQ_ASCLIN7_RX 42
#define IRQ_ASCLIN7_ERR 43
#define IRQ_ASCLIN8_TX 44
#define IRQ_ASCLIN8_RX 45
#define IRQ_ASCLIN8_ERR 46
#define IRQ_ASCLIN9_TX 47
#define IRQ_ASCLIN9_RX 48
#define IRQ_ASCLIN9_ERR 49
#define IRQ_ASCLIN10_TX 50
#define IRQ_ASCLIN10_RX 51
#define IRQ_ASCLIN10_ERR 52
#define IRQ_ASCLIN11_TX 53
#define IRQ_ASCLIN11_RX 54
#define IRQ_ASCLIN11_ERR 55
#define IRQ_MTUDONE 59
#define IRQ_QSPI0_TX 60
#define IRQ_QSPI0_RX 61
#define IRQ_QSPI0_ERR 62
#define IRQ_QSPI0_PT 63
#define IRQ_QSPI0_U 64
#define IRQ_QSPI1_TX 65
#define IRQ_QSPI1_RX 66
#define IRQ_QSPI1_ERR 67
#define IRQ_QSPI1_PT 68
#define IRQ_QSPI1_U 69
#define IRQ_QSPI2_TX 70
#define IRQ_QSPI2_RX 71
#define IRQ_QSPI2_ERR 72
#define IRQ_QSPI2_PT 73
#define IRQ_QSPI2_U 74
#define IRQ_QSPI3_TX 75
#define IRQ_QSPI3_RX 76
#define IRQ_QSPI3_ERR 77
#define IRQ_QSPI3_PT 78
#define IRQ_QSPI3_U 79
#define IRQ_QSPI4_TX 80
#define IRQ_QSPI4_RX 81
#define IRQ_QSPI4_ERR 82
#define IRQ_QSPI4_PT 83
#define IRQ_QSPI4_U 84
#define IRQ_HSCT0_SR 96
#define IRQ_HSSL0_CH0_COK 100
#define IRQ_HSSL0_CH0_RDI 101
#define IRQ_HSSL0_CH0_ERR 102
#define IRQ_HSSL0_CH0_TRG 103
#define IRQ_HSSL0_CH1_COK 104
#define IRQ_HSSL0_CH1_RDI 105
#define IRQ_HSSL0_CH1_ERR 106
#define IRQ_HSSL0_CH1_TRG 107
#define IRQ_HSSL0_CH2_COK 108
#define IRQ_HSSL0_CH2_RDI 109
#define IRQ_HSSL0_CH2_ERR 110
#define IRQ_HSSL0_CH2_TRG 111
#define IRQ_HSSL0_CH3_COK 112
#define IRQ_HSSL0_CH3_RDI 113
#define IRQ_HSSL0_CH3_ERR 114
#define IRQ_HSSL0_CH3_TRG 115
#define IRQ_HSSL0_EXI 116
#define IRQ_GETH1_SR0 117
#define IRQ_GETH1_SR1 118
#define IRQ_GETH1_SR2 119
#define IRQ_GETH1_SR3 120
#define IRQ_GETH1_SR4 121
#define IRQ_GETH1_SR5 122
#define IRQ_GETH1_SR6 123
#define IRQ_GETH1_SR7 124
#define IRQ_GETH1_SR8 125
#define IRQ_GETH1_SR9 126
#define IRQ_I2C0_DTR 136
#define IRQ_I2C0_ERR 137
#define IRQ_I2C0_P 138
#define IRQ_SENT0_SR 144
#define IRQ_SENT1_SR 145
#define IRQ_SENT2_SR 146
#define IRQ_SENT3_SR 147
#define IRQ_SENT4_SR 148
#define IRQ_SENT5_SR 149
#define IRQ_SENT6_SR 150
#define IRQ_SENT7_SR 151
#define IRQ_SENT8_SR 152
#define IRQ_SENT9_SR 153
#define IRQ_MSC0_SR0 156
#define IRQ_MSC0_SR1 157
#define IRQ_MSC0_SR2 158
#define IRQ_MSC0_SR3 159
#define IRQ_MSC0_SR4 160
#define IRQ_MSC1_SR0 161
#define IRQ_MSC1_SR1 162
#define IRQ_MSC1_SR2 163
#define IRQ_MSC1_SR3 164
#define IRQ_MSC1_SR4 165
#define IRQ_CCU0_SR0 176
#define IRQ_CCU0_SR1 177
#define IRQ_CCU0_SR2 178
#define IRQ_CCU0_SR3 179
#define IRQ_CCU1_SR0 180
#define IRQ_CCU1_SR1 181
#define IRQ_CCU1_SR2 182
#define IRQ_CCU1_SR3 183
#define IRQ_GPT120_CIRQ 184
#define IRQ_GPT120_T2 185
#define IRQ_GPT120_T3 186
#define IRQ_GPT120_T4 187
#define IRQ_GPT120_T5 188
#define IRQ_GPT120_T6 189
#define IRQ_STM0_SR0 192
#define IRQ_STM0_SR1 193
#define IRQ_STM1_SR0 194
#define IRQ_STM1_SR1 195
#define IRQ_STM2_SR0 196
#define IRQ_STM2_SR1 197
#define IRQ_FCE0_SR 204
#define IRQ_DMA0_ERR0 208
#define IRQ_DMA0_ERR1 209
#define IRQ_DMA0_ERR2 210
#define IRQ_DMA0_ERR3 211
#define IRQ_DMA0_CH0 220
#define IRQ_DMA0_CH1 221
#define IRQ_DMA0_CH2 222
#define IRQ_DMA0_CH3 223
#define IRQ_DMA0_CH4 224
#define IRQ_DMA0_CH5 225
#define IRQ_DMA0_CH6 226
#define IRQ_DMA0_CH7 227
#define IRQ_DMA0_CH8 228
#define IRQ_DMA0_CH9 229
#define IRQ_DMA0_CH10 230
#define IRQ_DMA0_CH11 231
#define IRQ_DMA0_CH12 232
#define IRQ_DMA0_CH13 233
#define IRQ_DMA0_CH14 234
#define IRQ_DMA0_CH15 235
#define IRQ_DMA0_CH16 236
#define IRQ_DMA0_CH17 237
#define IRQ_DMA0_CH18 238
#define IRQ_DMA0_CH19 239
#define IRQ_DMA0_CH20 240
#define IRQ_DMA0_CH21 241
#define IRQ_DMA0_CH22 242
#define IRQ_DMA0_CH23 243
#define IRQ_DMA0_CH24 244
#define IRQ_DMA0_CH25 245
#define IRQ_DMA0_CH26 246
#define IRQ_DMA0_CH27 247
#define IRQ_DMA0_CH28 248
#define IRQ_DMA0_CH29 249
#define IRQ_DMA0_CH30 250
#define IRQ_DMA0_CH31 251
#define IRQ_DMA0_CH32 252
#define IRQ_DMA0_CH33 253
#define IRQ_DMA0_CH34 254
#define IRQ_DMA0_CH35 255
#define IRQ_DMA0_CH36 256
#define IRQ_DMA0_CH37 257
#define IRQ_DMA0_CH38 258
#define IRQ_DMA0_CH39 259
#define IRQ_DMA0_CH40 260
#define IRQ_DMA0_CH41 261
#define IRQ_DMA0_CH42 262
#define IRQ_DMA0_CH43 263
#define IRQ_DMA0_CH44 264
#define IRQ_DMA0_CH45 265
#define IRQ_DMA0_CH46 266
#define IRQ_DMA0_CH47 267
#define IRQ_DMA0_CH48 268
#define IRQ_DMA0_CH49 269
#define IRQ_DMA0_CH50 270
#define IRQ_DMA0_CH51 271
#define IRQ_DMA0_CH52 272
#define IRQ_DMA0_CH53 273
#define IRQ_DMA0_CH54 274
#define IRQ_DMA0_CH55 275
#define IRQ_DMA0_CH56 276
#define IRQ_DMA0_CH57 277
#define IRQ_DMA0_CH58 278
#define IRQ_DMA0_CH59 279
#define IRQ_DMA0_CH60 280
#define IRQ_DMA0_CH61 281
#define IRQ_DMA0_CH62 282
#define IRQ_DMA0_CH63 283
#define IRQ_DMA0_CH64 284
#define IRQ_DMA0_CH65 285
#define IRQ_DMA0_CH66 286
#define IRQ_DMA0_CH67 287
#define IRQ_DMA0_CH68 288
#define IRQ_DMA0_CH69 289
#define IRQ_DMA0_CH70 290
#define IRQ_DMA0_CH71 291
#define IRQ_DMA0_CH72 292
#define IRQ_DMA0_CH73 293
#define IRQ_DMA0_CH74 294
#define IRQ_DMA0_CH75 295
#define IRQ_DMA0_CH76 296
#define IRQ_DMA0_CH77 297
#define IRQ_DMA0_CH78 298
#define IRQ_DMA0_CH79 299
#define IRQ_DMA0_CH80 300
#define IRQ_DMA0_CH81 301
#define IRQ_DMA0_CH82 302
#define IRQ_DMA0_CH83 303
#define IRQ_DMA0_CH84 304
#define IRQ_DMA0_CH85 305
#define IRQ_DMA0_CH86 306
#define IRQ_DMA0_CH87 307
#define IRQ_DMA0_CH88 308
#define IRQ_DMA0_CH89 309
#define IRQ_DMA0_CH90 310
#define IRQ_DMA0_CH91 311
#define IRQ_DMA0_CH92 312
#define IRQ_DMA0_CH93 313
#define IRQ_DMA0_CH94 314
#define IRQ_DMA0_CH95 315
#define IRQ_DMA0_CH96 316
#define IRQ_DMA0_CH97 317
#define IRQ_DMA0_CH98 318
#define IRQ_DMA0_CH99 319
#define IRQ_DMA0_CH100 320
#define IRQ_DMA0_CH101 321
#define IRQ_DMA0_CH102 322
#define IRQ_DMA0_CH103 323
#define IRQ_DMA0_CH104 324
#define IRQ_DMA0_CH105 325
#define IRQ_DMA0_CH106 326
#define IRQ_DMA0_CH107 327
#define IRQ_DMA0_CH108 328
#define IRQ_DMA0_CH109 329
#define IRQ_DMA0_CH110 330
#define IRQ_DMA0_CH111 331
#define IRQ_DMA0_CH112 332
#define IRQ_DMA0_CH113 333
#define IRQ_DMA0_CH114 334
#define IRQ_DMA0_CH115 335
#define IRQ_DMA0_CH116 336
#define IRQ_DMA0_CH117 337
#define IRQ_DMA0_CH118 338
#define IRQ_DMA0_CH119 339
#define IRQ_DMA0_CH120 340
#define IRQ_DMA0_CH121 341
#define IRQ_DMA0_CH122 342
#define IRQ_DMA0_CH123 343
#define IRQ_DMA0_CH124 344
#define IRQ_DMA0_CH125 345
#define IRQ_DMA0_CH126 346
#define IRQ_DMA0_CH127 347
#define IRQ_SDMMC0_ERR 348
#define IRQ_SDMMC0_DMA 349
#define IRQ_GETH0_SR0 352
#define IRQ_GETH0_SR1 353
#define IRQ_GETH0_SR2 354
#define IRQ_GETH0_SR3 355
#define IRQ_GETH0_SR4 356
#define IRQ_GETH0_SR5 357
#define IRQ_GETH0_SR6 358
#define IRQ_GETH0_SR7 359
#define IRQ_GETH0_SR8 360
#define IRQ_GETH0_SR9 361
#define IRQ_CAN0_INT0 364
#define IRQ_CAN0_INT1 365
#define IRQ_CAN0_INT2 366
#define IRQ_CAN0_INT3 367
#define IRQ_CAN0_INT4 368
#define IRQ_CAN0_INT5 369
#define IRQ_CAN0_INT6 370
#define IRQ_CAN0_INT7 371
#define IRQ_CAN0_INT8 372
#define IRQ_CAN0_INT9 373
#define IRQ_CAN0_INT10 374
#define IRQ_CAN0_INT11 375
#define IRQ_CAN0_INT12 376
#define IRQ_CAN0_INT13 377
#define IRQ_CAN0_INT14 378
#define IRQ_CAN0_INT15 379
#define IRQ_CAN1_INT0 380
#define IRQ_CAN1_INT1 381
#define IRQ_CAN1_INT2 382
#define IRQ_CAN1_INT3 383
#define IRQ_CAN1_INT4 384
#define IRQ_CAN1_INT5 385
#define IRQ_CAN1_INT6 386
#define IRQ_CAN1_INT7 387
#define IRQ_CAN1_INT8 388
#define IRQ_CAN1_INT9 389
#define IRQ_CAN1_INT10 390
#define IRQ_CAN1_INT11 391
#define IRQ_CAN1_INT12 392
#define IRQ_CAN1_INT13 393
#define IRQ_CAN1_INT14 394
#define IRQ_CAN1_INT15 395
#define IRQ_CAN2_INT0 396
#define IRQ_CAN2_INT1 397
#define IRQ_CAN2_INT2 398
#define IRQ_CAN2_INT3 399
#define IRQ_CAN2_INT4 400
#define IRQ_CAN2_INT5 401
#define IRQ_CAN2_INT6 402
#define IRQ_CAN2_INT7 403
#define IRQ_CAN2_INT8 404
#define IRQ_CAN2_INT9 405
#define IRQ_CAN2_INT10 406
#define IRQ_CAN2_INT11 407
#define IRQ_CAN2_INT12 408
#define IRQ_CAN2_INT13 409
#define IRQ_CAN2_INT14 410
#define IRQ_CAN2_INT15 411
#define IRQ_VADC_G0_SR0 412
#define IRQ_VADC_G0_SR1 413
#define IRQ_VADC_G0_SR2 414
#define IRQ_VADC_G0_SR3 415
#define IRQ_VADC_G1_SR0 416
#define IRQ_VADC_G1_SR1 417
#define IRQ_VADC_G1_SR2 418
#define IRQ_VADC_G1_SR3 419
#define IRQ_VADC_G2_SR0 420
#define IRQ_VADC_G2_SR1 421
#define IRQ_VADC_G2_SR2 422
#define IRQ_VADC_G2_SR3 423
#define IRQ_VADC_G3_SR0 424
#define IRQ_VADC_G3_SR1 425
#define IRQ_VADC_G3_SR2 426
#define IRQ_VADC_G3_SR3 427
#define IRQ_VADC_G8_SR0 444
#define IRQ_VADC_G8_SR1 445
#define IRQ_VADC_G8_SR2 446
#define IRQ_VADC_G8_SR3 447
#define IRQ_VADC_G9_SR0 448
#define IRQ_VADC_G9_SR1 449
#define IRQ_VADC_G9_SR2 450
#define IRQ_VADC_G9_SR3 451
#define IRQ_VADC_G10_SR0 452
#define IRQ_VADC_G10_SR1 453
#define IRQ_VADC_G10_SR2 454
#define IRQ_VADC_G10_SR3 455
#define IRQ_VADC_G11_SR0 456
#define IRQ_VADC_G11_SR1 457
#define IRQ_VADC_G11_SR2 458
#define IRQ_VADC_G11_SR3 459
#define IRQ_VADC_FC0_SR0 460
#define IRQ_VADC_FC1_SR0 461
#define IRQ_VADC_FC2_SR0 462
#define IRQ_VADC_FC3_SR0 463
#define IRQ_VADC_CG0_SR0 468
#define IRQ_VADC_CG0_SR1 469
#define IRQ_VADC_CG0_SR2 470
#define IRQ_VADC_CG0_SR3 471
#define IRQ_VADC_CG1_SR0 472
#define IRQ_VADC_CG1_SR1 473
#define IRQ_VADC_CG1_SR2 474
#define IRQ_VADC_CG1_SR3 475
#define IRQ_DSADC0_SRM 476
#define IRQ_DSADC0_SRA 477
#define IRQ_DSADC1_SRM 478
#define IRQ_DSADC1_SRA 479
#define IRQ_DSADC2_SRM 480
#define IRQ_DSADC2_SRA 481
#define IRQ_DSADC3_SRM 482
#define IRQ_DSADC3_SRA 483
#define IRQ_DSADC4_SRM 484
#define IRQ_DSADC4_SRA 485
#define IRQ_DSADC5_SRM 486
#define IRQ_DSADC5_SRA 487
#define IRQ_ERAY0_INT0 512
#define IRQ_ERAY0_INT1 513
#define IRQ_ERAY0_TINT0 514
#define IRQ_ERAY0_TINT1 515
#define IRQ_ERAY0_NDAT0 516
#define IRQ_ERAY0_NDAT1 517
#define IRQ_ERAY0_MBSC0 518
#define IRQ_ERAY0_MBSC1 519
#define IRQ_ERAY0_OBUSY 520
#define IRQ_ERAY0_IBUSY 521
#define IRQ_DMUHOST 536
#define IRQ_DMUFSI 537
#define IRQ_HSM0_HSM0 540
#define IRQ_HSM0_HSM1 541
#define IRQ_SCU_SCUERU0 544
#define IRQ_SCU_SCUERU1 545
#define IRQ_SCU_SCUERU2 546
#define IRQ_SCU_SCUERU3 547
#define IRQ_PMSDTS 555
#define IRQ_PMS0_SR 556
#define IRQ_PMS1_SR 557
#define IRQ_PMS2_SR 558
#define IRQ_PMS3_SR 559
#define IRQ_SCR 560
#define IRQ_SMU0_SR0 564
#define IRQ_SMU0_SR1 565
#define IRQ_SMU0_SR2 566
#define IRQ_PSI50_SR0 568
#define IRQ_PSI50_SR1 569
#define IRQ_PSI50_SR2 570
#define IRQ_PSI50_SR3 571
#define IRQ_PSI50_SR4 572
#define IRQ_PSI50_SR5 573
#define IRQ_PSI50_SR6 574
#define IRQ_PSI50_SR7 575
#define IRQ_DAM0_LI0 580
#define IRQ_DAM0_RI0 581
#define IRQ_DAM0_LI1 582
#define IRQ_DAM0_RI1 583
#define IRQ_DAM0_DR 584
#define IRQ_DAM0_ERR 585
#define IRQ_CIF0_MI 592
#define IRQ_CIF0_MIEP 593
#define IRQ_CIF0_ISP 594
#define IRQ_CIF0_MJPEG 595
#define IRQ_PSI5S0_SR0 596
#define IRQ_PSI5S0_SR1 597
#define IRQ_PSI5S0_SR2 598
#define IRQ_PSI5S0_SR3 599
#define IRQ_PSI5S0_SR4 600
#define IRQ_PSI5S0_SR5 601
#define IRQ_PSI5S0_SR6 602
#define IRQ_PSI5S0_SR7 603
#define IRQ_GPSR0_SR0 612
#define IRQ_GPSR0_SR1 613
#define IRQ_GPSR0_SR2 614
#define IRQ_GPSR0_SR3 615
#define IRQ_GPSR0_SR4 616
#define IRQ_GPSR0_SR5 617
#define IRQ_GPSR0_SR6 618
#define IRQ_GPSR0_SR7 619
#define IRQ_GPSR1_SR0 620
#define IRQ_GPSR1_SR1 621
#define IRQ_GPSR1_SR2 622
#define IRQ_GPSR1_SR3 623
#define IRQ_GPSR1_SR4 624
#define IRQ_GPSR1_SR5 625
#define IRQ_GPSR1_SR6 626
#define IRQ_GPSR1_SR7 627
#define IRQ_GPSR2_SR0 628
#define IRQ_GPSR2_SR1 629
#define IRQ_GPSR2_SR2 630
#define IRQ_GPSR2_SR3 631
#define IRQ_GPSR2_SR4 632
#define IRQ_GPSR2_SR5 633
#define IRQ_GPSR2_SR6 634
#define IRQ_GPSR2_SR7 635
#define IRQ_GTM_AEIIRQ 668
#define IRQ_GTM_ARUIRQ0 669
#define IRQ_GTM_ARUIRQ1 670
#define IRQ_GTM_ARUIRQ2 671
#define IRQ_GTM_BRCIRQ 672
#define IRQ_GTM_CMBIRQ 673
#define IRQ_GTM_SPEIRQ0 674
#define IRQ_GTM_SPEIRQ1 675
#define IRQ_GTM_PSM0_0 680
#define IRQ_GTM_PSM0_1 681
#define IRQ_GTM_PSM0_2 682
#define IRQ_GTM_PSM0_3 683
#define IRQ_GTM_PSM0_4 684
#define IRQ_GTM_PSM0_5 685
#define IRQ_GTM_PSM0_6 686
#define IRQ_GTM_PSM0_7 687
#define IRQ_GTM_DPLL0 704
#define IRQ_GTM_DPLL1 705
#define IRQ_GTM_DPLL2 706
#define IRQ_GTM_DPLL3 707
#define IRQ_GTM_DPLL4 708
#define IRQ_GTM_DPLL5 709
#define IRQ_GTM_DPLL6 710
#define IRQ_GTM_DPLL7 711
#define IRQ_GTM_DPLL8 712
#define IRQ_GTM_DPLL9 713
#define IRQ_GTM_DPLL10 714
#define IRQ_GTM_DPLL11 715
#define IRQ_GTM_DPLL12 716
#define IRQ_GTM_DPLL13 717
#define IRQ_GTM_DPLL14 718
#define IRQ_GTM_DPLL15 719
#define IRQ_GTM_DPLL16 720
#define IRQ_GTM_DPLL17 721
#define IRQ_GTM_DPLL18 722
#define IRQ_GTM_DPLL19 723
#define IRQ_GTM_DPLL20 724
#define IRQ_GTM_DPLL21 725
#define IRQ_GTM_DPLL22 726
#define IRQ_GTM_DPLL23 727
#define IRQ_GTM_DPLL24 728
#define IRQ_GTM_DPLL25 729
#define IRQ_GTM_DPLL26 730
#define IRQ_GTM_ERR 732
#define IRQ_GTM_TIM0_0 740
#define IRQ_GTM_TIM0_1 741
#define IRQ_GTM_TIM0_2 742
#define IRQ_GTM_TIM0_3 743
#define IRQ_GTM_TIM0_4 744
#define IRQ_GTM_TIM0_5 745
#define IRQ_GTM_TIM0_6 746
#define IRQ_GTM_TIM0_7 747
#define IRQ_GTM_TIM1_0 748
#define IRQ_GTM_TIM1_1 749
#define IRQ_GTM_TIM1_2 750
#define IRQ_GTM_TIM1_3 751
#define IRQ_GTM_TIM1_4 752
#define IRQ_GTM_TIM1_5 753
#define IRQ_GTM_TIM1_6 754
#define IRQ_GTM_TIM1_7 755
#define IRQ_GTM_TIM2_0 756
#define IRQ_GTM_TIM2_1 757
#define IRQ_GTM_TIM2_2 758
#define IRQ_GTM_TIM2_3 759
#define IRQ_GTM_TIM2_4 760
#define IRQ_GTM_TIM2_5 761
#define IRQ_GTM_TIM2_6 762
#define IRQ_GTM_TIM2_7 763
#define IRQ_GTM_TIM3_0 764
#define IRQ_GTM_TIM3_1 765
#define IRQ_GTM_TIM3_2 766
#define IRQ_GTM_TIM3_3 767
#define IRQ_GTM_TIM3_4 768
#define IRQ_GTM_TIM3_5 769
#define IRQ_GTM_TIM3_6 770
#define IRQ_GTM_TIM3_7 771
#define IRQ_GTM_TIM4_0 772
#define IRQ_GTM_TIM4_1 773
#define IRQ_GTM_TIM4_2 774
#define IRQ_GTM_TIM4_3 775
#define IRQ_GTM_TIM4_4 776
#define IRQ_GTM_TIM4_5 777
#define IRQ_GTM_TIM4_6 778
#define IRQ_GTM_TIM4_7 779
#define IRQ_GTM_TIM5_0 780
#define IRQ_GTM_TIM5_1 781
#define IRQ_GTM_TIM5_2 782
#define IRQ_GTM_TIM5_3 783
#define IRQ_GTM_TIM5_4 784
#define IRQ_GTM_TIM5_5 785
#define IRQ_GTM_TIM5_6 786
#define IRQ_GTM_TIM5_7 787
#define IRQ_GTM_MCS0_0 812
#define IRQ_GTM_MCS0_1 813
#define IRQ_GTM_MCS0_2 814
#define IRQ_GTM_MCS0_3 815
#define IRQ_GTM_MCS0_4 816
#define IRQ_GTM_MCS0_5 817
#define IRQ_GTM_MCS0_6 818
#define IRQ_GTM_MCS0_7 819
#define IRQ_GTM_MCS1_0 820
#define IRQ_GTM_MCS1_1 821
#define IRQ_GTM_MCS1_2 822
#define IRQ_GTM_MCS1_3 823
#define IRQ_GTM_MCS1_4 824
#define IRQ_GTM_MCS1_5 825
#define IRQ_GTM_MCS1_6 826
#define IRQ_GTM_MCS1_7 827
#define IRQ_GTM_MCS2_0 828
#define IRQ_GTM_MCS2_1 829
#define IRQ_GTM_MCS2_2 830
#define IRQ_GTM_MCS2_3 831
#define IRQ_GTM_MCS2_4 832
#define IRQ_GTM_MCS2_5 833
#define IRQ_GTM_MCS2_6 834
#define IRQ_GTM_MCS2_7 835
#define IRQ_GTM_MCS3_0 836
#define IRQ_GTM_MCS3_1 837
#define IRQ_GTM_MCS3_2 838
#define IRQ_GTM_MCS3_3 839
#define IRQ_GTM_MCS3_4 840
#define IRQ_GTM_MCS3_5 841
#define IRQ_GTM_MCS3_6 842
#define IRQ_GTM_MCS3_7 843
#define IRQ_GTM_MCS4_0 844
#define IRQ_GTM_MCS4_1 845
#define IRQ_GTM_MCS4_2 846
#define IRQ_GTM_MCS4_3 847
#define IRQ_GTM_MCS4_4 848
#define IRQ_GTM_MCS4_5 849
#define IRQ_GTM_MCS4_6 850
#define IRQ_GTM_MCS4_7 851
#define IRQ_GTM_TOM0_0 900
#define IRQ_GTM_TOM0_1 901
#define IRQ_GTM_TOM0_2 902
#define IRQ_GTM_TOM0_3 903
#define IRQ_GTM_TOM0_4 904
#define IRQ_GTM_TOM0_5 905
#define IRQ_GTM_TOM0_6 906
#define IRQ_GTM_TOM0_7 907
#define IRQ_GTM_TOM1_0 908
#define IRQ_GTM_TOM1_1 909
#define IRQ_GTM_TOM1_2 910
#define IRQ_GTM_TOM1_3 911
#define IRQ_GTM_TOM1_4 912
#define IRQ_GTM_TOM1_5 913
#define IRQ_GTM_TOM1_6 914
#define IRQ_GTM_TOM1_7 915
#define IRQ_GTM_TOM2_0 916
#define IRQ_GTM_TOM2_1 917
#define IRQ_GTM_TOM2_2 918
#define IRQ_GTM_TOM2_3 919
#define IRQ_GTM_TOM2_4 920
#define IRQ_GTM_TOM2_5 921
#define IRQ_GTM_TOM2_6 922
#define IRQ_GTM_TOM2_7 923
#define IRQ_GTM_ATOM0_0 956
#define IRQ_GTM_ATOM0_1 957
#define IRQ_GTM_ATOM0_2 958
#define IRQ_GTM_ATOM0_3 959
#define IRQ_GTM_ATOM1_0 960
#define IRQ_GTM_ATOM1_1 961
#define IRQ_GTM_ATOM1_2 962
#define IRQ_GTM_ATOM1_3 963
#define IRQ_GTM_ATOM2_0 964
#define IRQ_GTM_ATOM2_1 965
#define IRQ_GTM_ATOM2_2 966
#define IRQ_GTM_ATOM2_3 967
#define IRQ_GTM_ATOM3_0 968
#define IRQ_GTM_ATOM3_1 969
#define IRQ_GTM_ATOM3_2 970
#define IRQ_GTM_ATOM3_3 971
#define IRQ_GTM_ATOM4_0 972
#define IRQ_GTM_ATOM4_1 973
#define IRQ_GTM_ATOM4_2 974
#define IRQ_GTM_ATOM4_3 975
#define IRQ_GTM_ATOM5_0 976
#define IRQ_GTM_ATOM5_1 977
#define IRQ_GTM_ATOM5_2 978
#define IRQ_GTM_ATOM5_3 979
#define IRQ_GTM_MCSW0 1012
#define IRQ_GTM_MCSW1 1013
#define IRQ_GTM_MCSW2 1014
#define IRQ_GTM_MCSW3 1015
#define IRQ_GTM_MCSW4 1016
#define IRQ_GTM_MCSW5 1017
#define IRQ_GTM_MCSW6 1018
#define IRQ_GTM_MCSW7 1019
#define IRQ_GTM_MCSW8 1020
#define IRQ_GTM_MCSW9 1021
#define IRQ_P00_0_TIM5_4 IRQ_GTM_TIM5_4
#define IRQ_P00_0_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P00_0_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P00_1_TIM5_5 IRQ_GTM_TIM5_5
#define IRQ_P00_1_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P00_1_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P00_2_TIM5_6 IRQ_GTM_TIM5_6
#define IRQ_P00_2_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P00_2_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P00_3_TIM5_7 IRQ_GTM_TIM5_7
#define IRQ_P00_3_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P00_3_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P00_4_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P00_4_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P00_5_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P00_5_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P00_5_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P00_6_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P00_6_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P00_6_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P00_7_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P00_7_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P00_7_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P00_8_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P00_8_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P00_8_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P00_9_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P00_9_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P00_9_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P00_10_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P00_10_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P00_10_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P00_11_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P00_11_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P00_11_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P00_12_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P00_12_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P00_12_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P01_3_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P01_3_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P01_3_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P01_4_TIM4_6 IRQ_GTM_TIM4_6
#define IRQ_P01_4_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P01_4_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P01_5_TIM5_3 IRQ_GTM_TIM5_3
#define IRQ_P01_5_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P01_5_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P01_6_TIM5_6 IRQ_GTM_TIM5_6
#define IRQ_P01_6_TIM5_5 IRQ_GTM_TIM5_5
#define IRQ_P01_6_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P01_7_TIM5_7 IRQ_GTM_TIM5_7
#define IRQ_P01_7_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P02_0_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P02_0_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P02_1_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P02_1_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P02_2_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P02_2_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P02_3_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P02_3_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P02_4_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P02_4_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P02_5_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P02_5_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P02_6_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P02_6_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P02_6_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P02_7_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P02_7_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P02_7_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P02_8_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P02_8_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P02_8_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P02_9_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P02_9_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P02_9_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P02_10_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P02_10_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P02_10_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P02_11_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P02_11_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P02_11_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P10_0_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P10_0_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P10_0_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P10_1_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P10_1_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P10_1_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P10_2_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P10_2_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P10_2_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P10_3_TIM4_6 IRQ_GTM_TIM4_6
#define IRQ_P10_3_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P10_3_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P10_4_TIM4_7 IRQ_GTM_TIM4_7
#define IRQ_P10_4_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P10_4_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P10_5_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P10_5_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P10_5_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P10_6_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P10_6_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P10_6_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P10_7_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P10_7_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P10_8_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P10_8_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P10_8_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P11_0_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P11_0_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P11_1_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P11_1_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P11_2_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P11_2_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P11_3_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P11_3_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P11_4_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P11_4_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P11_5_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P11_5_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P11_6_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P11_6_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P11_7_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P11_7_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P11_8_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P11_8_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P11_9_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P11_9_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P11_10_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P11_10_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P11_10_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P11_11_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P11_11_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P11_11_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P11_12_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P11_12_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P11_13_TIM4_6 IRQ_GTM_TIM4_6
#define IRQ_P11_13_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P11_14_TIM4_7 IRQ_GTM_TIM4_7
#define IRQ_P11_14_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P11_15_TIM4_7 IRQ_GTM_TIM4_7
#define IRQ_P11_15_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P12_0_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P12_0_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P12_1_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P12_1_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P13_0_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P13_0_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P13_1_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P13_1_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P13_2_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P13_2_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P13_3_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P13_3_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P14_0_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P14_0_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P14_1_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P14_1_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P14_2_TIM1_5 IRQ_GTM_TIM1_5
